{
"base_model_name_or_path": null,
"bias": "none",
"fan_in_fan_out": false,
"inference_mode": false,
"init_lora_weights": true,
"lora_alpha": 32,
"lora_dropout": 0.1,
"target_modules": ["q", "v", "o", "wi_0", "wi_1"],
"peft_type": "LORA",
"r": 16,
"modules_to_save": null,
"task_type": "CAUSAL_LM"
}